//Подсчет предметов для табличной части 
Функция ВернутьКолвоПредметов()
	Возврат Перечисления.ПеречислениеПредметыПоступленияАбитуриентов.Количество(); 
КонецФункции
Функция ВернутьЗначениеПредметаПоИндексу(индекс_номер)
	Возврат Перечисления.ПеречислениеПредметыПоступленияАбитуриентов.Получить(индекс_номер);
КонецФункции

//Вызов процедур выше после записи
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи) Экспорт		
КонецПроцедуры


//Процедуры вывода перечислений на форму
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Счетчик = 0;
	
 	Если (Объект.ОценкиАбитуриента.Количество() < ВернутьКолвоПредметов()) Тогда
		Пока (Счетчик < ВернутьКолвоПредметов()) Цикл
			Новаястрока = Объект.ОценкиАбитуриента.Добавить();
			Новаястрока.Предмет = ВернутьЗначениеПредметаПоИндексу(Счетчик);
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ОценкиАбитуриентаПриИзменении(Элемент)
	СуммаЗначений = 0;
	КоличествоЗначенийШоражников = 0;
	Для пацана = 0 По Объект.ОценкиАбитуриента.Количество()-1 Цикл
		Если ЗначениеЗаполнено(Объект.ОценкиАбитуриента[пацана].Оценка) Тогда
			ТекущаяОценка = Объект.ОценкиАбитуриента[пацана].Оценка;
			Если ((ТекущаяОценка < 2) или (ТекущаяОценка > 5)) Тогда
				Сообщить("Некорректный ввод оценки по дисциплине '"+Объект.ОценкиАбитуриента[пацана].Предмет+"'!");
			КонецЕсли;	
			КоличествоЗначенийШоражников = КоличествоЗначенийШоражников + 1;
			СуммаЗначений = СуммаЗначений + ТекущаяОценка;
		КонецЕсли;
	КонецЦикла;
	СреднееЗначение = СуммаЗначений / КоличествоЗначенийШоражников;
	Объект.СреднийБаллАбитуриента = СреднееЗначение;		
КонецПроцедуры

//Обработка картинок
&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	ИмяФайла = "";
	ПутьФайла = "";
	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда
		Фото = ПутьФайла;
		УстановитьКартинку(ИмяФайла);
	КонецЕсли; 
КонецПроцедуры
&НаСервере
Процедура УстановитьКартинку(ИмяФайла)

	НовыйФайлКартинки = Справочники.ФайлыСистемы.СоздатьЭлемент();
	НовыйФайлКартинки.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	НовыйФайлКартинки.Наименование = ИмяФайла;
	НовыйФайлКартинки.Дата = ТекущаяДата();
	Фото = ПоместитьВоВременноеХранилище(НовыйФайлКартинки.Файл.Получить());
	НовыйФайлКартинки.Записать();
	Объект.ФотоАбитуриента = НовыйФайлКартинки.Ссылка;
	
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Фото = ПолучитьНавигационнуюСсылку(Объект.ФотоАбитуриента, "Файл");
	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры

